{
  "services": [
    { "id": 1,
      "event_name": "Engagement Party",
      "description": "An exuberant gathering to commemorate the joyful engagement of the couple, uniting family and friends in celebration.",
      "details": "The engagement party is a prelude to the grand wedding ceremony, often characterized by an atmosphere of relaxed jubilation. Guests come together to offer heartfelt congratulations and bestow thoughtful gifts upon the engaged couple. It's a momentous occasion filled with laughter, smiles, and well-wishing as the couple begins their journey towards a lifetime of love and togetherness.",
      "image": "https://i.ibb.co/x6gNgQ2/engestment.jpg",
      "price": "$5,000",
      "service": "Event planning, catering, decorations, and invitations are essential services that contribute to the success of this event. Event planners assist in creating a seamless experience, catering services provide delectable dishes, decorators transform the venue into a festive space, and invitations set the tone for the celebration."
    },
    { "id" : 2,
      "event_name": "Bridal Shower",
      "description": "A heartwarming pre-wedding festivity organized in honor of the bride, designed to shower her with love, gifts, and cherished memories.",
      "details": "Bridal showers are an intimate affair where the bride is surrounded by her closest friends and family. The event revolves around gift-giving, playful games, and heartfelt conversations. It is an opportunity for loved ones to express their love and support for the bride as she prepares to embark on her marital journey. These gatherings are infused with warmth, laughter, and anticipation, creating lasting memories for the bride and her inner circle.",
      "image": "https://i.ibb.co/JdFrtqx/bridal-shower.jpg",
      "price": "$4,500",
      "service": "Service providers play a crucial role in bringing the bridal shower to life. Venue rentals offer a suitable space for the event, gift registries simplify gift-giving, games and activities keep guests engaged, and catering ensures delightful refreshments and treats for all attendees."
    },
    { "id" :3,
      "event_name": "Bachelor and Bachelorette Parties",
      "description": "Vibrant pre-wedding festivities held for the bride and groom, offering them a final taste of singlehood with their closest friends.",
      "details": "Bachelor and bachelorette parties come in various forms, from relaxed dinners to adventurous getaways. These gatherings are an opportunity for the bride and groom to create cherished memories with their closest friends before stepping into married life. Whether it's a night of laughter and camaraderie or an adrenaline-fueled adventure, these parties symbolize the transition from singlehood to wedded bliss.",
      "image": "https://i.ibb.co/Yf9nd6q/Bachelor-and-Bachelorette-Parties.jpg",
      "price": "$7,500",
      "service": "Service providers contribute to the success of these parties by assisting in event planning, arranging transportation for groups, organizing entertainment, and ensuring comfortable accommodations for all participants."
    },
    { "id" : 4,
      "event_name": "Rehearsal Dinner",
      "description": "An intimate pre-wedding dinner where close family and the wedding party gather to rehearse and celebrate the upcoming nuptials.",
      "details": "Held on the eve of the wedding, the rehearsal dinner is an occasion of intimacy and camaraderie. It provides an opportunity for the key participants in the wedding to familiarize themselves with the ceremony logistics while enjoying a memorable meal together. It's a heartfelt gesture of appreciation for those who will play pivotal roles in the wedding.",
      "image": "https://i.ibb.co/FxFWQ7v/Rehearsal-Dinner.jpg",
      "price" : "$2,500",
      "service": "Service providers like caterers, venue rentals, transportation services, and decorators play a vital role in ensuring the rehearsal dinner runs smoothly. They contribute to the atmosphere of warmth and celebration."
    },
    { "id" : 5,
      "event_name": "Wedding Ceremony",
      "description": "The poignant exchange of vows and rings, symbolizing the official union of the couple, often set in a meaningful location.",
      "details": "The wedding ceremony is the heart of the entire wedding celebration. It's the moment when the couple publicly declares their commitment to each other in front of their loved ones. The choice of location, whether it's a place of worship, a serene garden, or a destination far from home, adds a personal touch to the proceedings, making it a cherished memory for all in attendance.",
      "image": "https://i.ibb.co/Tt0fWC1/outdoor-weeding.jpg",
      "price": "$6,000",
      "service": "A multitude of service providers, including officiants, venue rentals, decorators, photographers, musicians, and floral designers, come together to create a harmonious and beautiful ceremony."
    },
    { "id" : 6,
      "event_name": "Wedding Reception",
      "description": "A festive celebration following the wedding ceremony, complete with a sumptuous meal, lively dancing, and heartfelt toasts.",
      "details": "The wedding reception is the grand finale of the wedding festivities, an exuberant party where guests come together to celebrate the newlyweds' union. It includes traditions like the first dance, cutting the wedding cake, and touching speeches. It's a time for joy, laughter, and dancing the night away, creating unforgettable memories for all.",
      "image": "https://i.ibb.co/FwfKqRB/Wedding-Reception.jpg",
      "price": "$2,500",
      "service": "Service providers, such as caterers, venue rentals, entertainment professionals, photographers, decorators, and event coordinators, collaborate to orchestrate a seamless and unforgettable reception experience."
    }
  ]
}



